app/views/posts/index.html.haml

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 8]]
---
      %p.author
        created by #{ User.find_by_id(post.user_id).name} about 5 minutes ago
      %p
        = pluralize(post.comments.count, "Comment")