app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 8]]
INSERT INTO "comments" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "woahz"], ["created_at", "2015-02-19 20:44:29.295051"], ["updated_at", "2015-02-19 20:44:29.295051"]]
UPDATE "comments" SET "user_id" = ?, "post_id" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["user_id", 1], ["post_id", 8], ["updated_at", "2015-02-19 20:49:13.297470"], ["id", 3]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = Comment.create(params[:comment].permit(:content))
    @comment.user_id = current_user.id
	  @comment.post_id = @post.id

	  if @comment.content.length > 0
      if @comment.save