app/controllers/posts_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 8
---
	def show
	  @comments = Comment.where(post_id: @post)

INSERT INTO "posts" ("title", "link", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "hey you"], ["link", "wewr"], ["description", "sfdsf"], ["user_id", 1], ["created_at", "2015-02-19 19:40:26.792185"], ["updated_at", "2015-02-19 19:40:26.792185"]]
---
	def create
	  @post  = current_user.posts.build(post_params)

	  if @post.save

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 5]]
---
	def destroy
	  @post.destroy if current_user.id == @post.user_id